exercises/exercise_05_Turingmaschinen.tex
% Created 2025-12-31 Mi 14:02
% Intended LaTeX compiler: xelatex
\documentclass[a4paper,14pt,ngerman]{scrartcl}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{polyglossia}
\usepackage{polyglossia}
\setmainlanguage[variant=german]{german}
\usepackage{polyglossia}
\setdefaultlanguage{german}
\PolyglossiaSetup{german}{shorthands=on}
\AtBeginDocument{\let\babelprovide\relax}
\AtBeginDocument{\let\shorthandon\relax}
\AtBeginDocument{\let\shorthandoff\relax}
\setmainfont{Gentium Book Basic}
\setsansfont{Latin Modern Sans}
\setmonofont{Latin Modern Mono}
\usepackage{fancyhdr}
\usepackage{graphicx}
\usepackage{amsmath,amssymb}
\usepackage{xcolor}
\usepackage{xurl}
\usepackage{listings}
\usepackage{setspace}
\setstretch{1.3}
\author{Elias}
\date{\today}
\title{Übungsblatt 5}
\hypersetup{
 pdfauthor={Elias},
 pdftitle={Übungsblatt 5},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.1 (Org mode 9.7.11)}, 
 pdflang={German}}
\begin{document}

\section{\textbf{Übung 5}}
\label{sec:orgbb12862}
\subsection{\textbf{Turingmaschinen}}
\label{sec:orgd7bc67b}

\textbf{Hinweis}

Ist kein spezifischer Typ einer Turingmaschine in einer Aufgabe
gefordert, so ist eine 1-Band-Turingmaschine zu bevorzugen.
\subsubsection{\textbf{Aufgabe 1}}
\label{sec:org6fd52be}

Konstruieren Sie eine Turingmaschine, die das Wortproblem für die
Sprache \[L=\{a^nb^nc^nd^n \mid n\geq 0 \}\] entscheidet.
\subsubsection{\textbf{Aufgabe 2}}
\label{sec:org41b1261}

Konstruieren Sie eine Turingmaschine, die das Wortproblem für die
Sprache \[L=\{w\tilde{w} \mid w \in \{a,b\}^*\}\] entscheidet.
\subsubsection{\textbf{Aufgabe 3}}
\label{sec:org6366497}

Konstruieren Sie eine 2-Band-Turingmaschine, die das Wortproblem für die
Sprache \[L=\{ww \mid w \in \{a,b\}^+\}\] entscheidet.

Gehen Sie davon aus, dass das Wort zu Beginn auf dem ersten Band stehe,
das zweite Band sei leer.
\subsubsection{\textbf{Aufgabe 4}}
\label{sec:orge1756a1}

Konstruieren Sie eine Turingmaschine, die das Wortproblem für die
Sprache \[L=\{w \in \{a,b,c\}^*\mid |w|_a=|w|_b=|w|_c\}\] entscheidet.
Hierbei ist \(|w|_a\) die Anzahl \(a\)'s im Wort \(w\).
\end{document}
